{
    "about": "Here is the data you requested. Remember: Telegram is ad free, it doesn't use your data for ad targeting and doesn't sell it to others. Telegram only keeps the information it needs to function as a secure and feature-rich cloud service.\n\nCheck out Settings > Privacy & Security on Telegram's mobile apps for the relevant settings.",
    "contacts": {
     "about": "If you allow access, your contacts are continuously synced with Telegram. Thanks to this, you can easily switch to Telegram and immediately connect with friends across all your devices. We use data about your contacts to let you know when they join Telegram, and to display them by the name you set for them in your phone.\n\nYou can disable contact syncing or delete your stored contacts in Settings > Privacy & Security on Telegram's mobile apps.",
     "list": [
      {
       "user_id": 0,
       "first_name": "Marek",
       "last_name": "Random",
       "phone_number": "0079290000000",
       "date": "2018-11-16T00:00:00"
      },
      {
       "user_id": 0,
       "first_name": "Andrew",
       "last_name": "NoName",
       "phone_number": "+79210000000",
       "date": "2018-07-22T00:00:00"
      }
     ]
    },
    "frequent_contacts": {
     "about": "This rating shows which people you are likelier to message frequently. Telegram uses this data to populate the 'People' box at the top of the Search section. This rating is also calculated for inline bots so that the app can suggest the bots you are most likely to use in the attachment menu (or when you start a new message with \"@\").\n\nTo delete this data, go to Settings > Privacy & Security and disable 'Suggest Frequent Contacts' (requires Telegram for iOS v.4.8.3 or Telegram for Android v.4.8.10 or higher).",
     "list": [
      {
       "id": 1000000000,
       "category": "people",
       "type": "user",
       "name": "Marek Random",
       "rating": 230.524948
      },
      {
       "id": 1000000001,
       "category": "people",
       "type": "user",
       "name": "Andrew NoName",
       "rating": 141.854416
      }
     ]
    }
   }